==================
Literal
==================

{{ 'string' }}

---

(program
 (expression
  (string)))

==================
Filter
==================

{{ 'string two' | split: " " }}

---

(program
 (expression
  (string)
  (filter
   name: (identifier)
   (argument_list (string)))))

==================
Filter w/ variable
==================

{% assign space = " " %}
{{ 'string two' | split: space }}

---

(program
 (statement
  (assignment
   variable_name: (identifier)
    value: (expression (string))))
 (expression
  (string)
  (filter
   name: (identifier)
   (argument_list (identifier)))))

==================
Many filters
==================

{{ 'string two' | split: space | first }}

---

(program
 (expression
  (string)
  (filter
   name: (identifier)
   (argument_list (identifier)))
  (filter
   name: (identifier))))
